c5/src/InformationRegisters/ReadingLog/ReadingLog.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ReadingLog</name>
  <resources>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </resources>
  <resources>
    <name>Document</name>
    <type>
      <types>DocumentRef.Document</types>
    </type>
  </resources>
  <resources>
    <name>Memo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/InformationRegisters/ReadingLog/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure Add ( Document, Memo = undefined ) export
	
	SetPrivilegedMode ( true );
	r = InformationRegisters.ReadingLog.CreateRecordManager ();
	r.User = SessionParameters.User;
	r.Document = Document;
	r.Date = CurrentSessionDate ();
	r.ID = new UUID ();
	r.Memo = Memo;
	r.Write ();
	SetPrivilegedMode ( false );
	
EndProcedure 

#endif
